tutorials/NACA0012/NACA0012_7k_M050_a0/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.4.1                                 |
|   \\  /    A nd           | Web:      http://www.openfoam.org               |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

FoamFile
{
    version 2.0;
    format ascii;

    root "/home/elisa/TESI/MESHES/2D_MESH_FOAM";
    case "NACA0012";
    instance "constant";
    local "polyMesh";

    class polyBoundaryMesh;
    object boundary;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
inlet-outlet
{
    type patch;
    physicalType supersonicInlet;
    nFaces 40;
    startFace 9808;
}

body
{
    type patch;
    physicalType slip;
    nFaces 204;
    startFace 9848;
}

defaultFaces
{
    type empty;
    physicalType empty;
    nFaces 13240;
    startFace 10052;
}
)

// ************************************************************************* //
